---
type: FilterableValueProvider
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# FilterableValueProvider

`Autodesk.Revit.DB.FilterableValueProvider` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAssociatedGlobalParameterValue | 2011 | `public ElementId GetAssociatedGlobalParameterValue ( Element element )` |
| Method | GetDoubleValue | 2011 | `public double GetDoubleValue ( Element element )` |
| Method | GetElementIdValue | 2011 | `public ElementId GetElementIdValue ( Element element )` |
| Method | GetIntegerValue | 2011 | `public int GetIntegerValue ( Element element )` |
| Method | GetStringValue | 2011 | `public string GetStringValue ( Element element )` |
| Method | IsDoubleValueSupported | 2011 | `public bool IsDoubleValueSupported ( Element element )` |
| Method | IsElementIdValueSupported | 2011 | `public bool IsElementIdValueSupported ( Element element )` |
| Method | IsIntegerValueSupported | 2011 | `public bool IsIntegerValueSupported ( Element element )` |
| Method | IsStringValueSupported | 2011 | `public bool IsStringValueSupported ( Element element )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |